Revit 2024 API
AnalysisDisplayLegend Class
 The legend that describes an Analysis Visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class AnalysisDisplayLegend : Element
Visual Basic
Public Class AnalysisDisplayLegend _
	Inherits Element
Visual C++
public ref class AnalysisDisplayLegend : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
See Also
AnalysisDisplayLegend Members
Autodesk.Revit.DB.Analysis Namespace